init.org
#+TITLE: Init
#+AUTHOR: Chris
#+STARTUP: showeverything
#+PROPERTY: header-args :tangle "~/.emacs.d/init.el"
#+auto_tangle: t

* Common configurations
The following packages are conifgs that can be shared across environemnts (e.g., home and work)
** Initialize package sources and use-package
#+begin_src emacs-lisp
  ;; Initialize package sources
  (require 'package)
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")
                           ("nongnu" . "https://elpa.nongnu.org/nongnu/")))
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))
  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src
** org-mode auto-tangle
Configure auto-tangle so we don't have to manually tangle our init file
#+begin_src emacs-lisp
  (use-package org-auto-tangle
    :defer t
    :hook (org-mode . org-auto-tangle-mode))
#+end_src
** Disable / configure window elements
#+begin_src emacs-lisp
  (scroll-bar-mode -1)  ; Disable visible scrollbar
  (tool-bar-mode -1)    ; Disable the toolbar
  (menu-bar-mode -1)    ; Disable the menu bar
  (set-fringe-mode 10)  ; Give some room on the sides
  (setq visible-bell t) ; Enable visible bell
#+end_src

